## Python function to delete string columns

In [7]:
import pandas as pd

In [62]:
df = pd.DataFrame({"A":['a','ds','sd','ewr','kij'],"B":['vvv','ddd','fff','hhh','kkk'],"C":[1,2,3,4,5]})

In [63]:
df

     A    B  C
0    a  vvv  1
1   ds  ddd  2
2   sd  fff  3
3  ewr  hhh  4
4  kij  kkk  5

In [80]:
def deleteStringColumns(df):
    col = list(df.select_dtypes(include='object').columns)
    df = df.drop(col,axis=1)
    return df

In [81]:
df_deleted = deleteStringColumns(df)

In [82]:
df_deleted

   C
0  1
1  2
2  3
3  4
4  5